// Напишите программу, которая принимает на вход трехзначное число и на выходе показывает вторую цифру этого числа

// Console.Write("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int second = (num /10) % 10;

// if (num > 100 && num < 1000)
// {
//     Console.WriteLine(second);
// }

// else
// {
//     Console.WriteLine("Некорректное значение");
// }




